---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetZ
source: html/ee494eeb-e414-9f58-15c1-3e15f71eb546.htm
---
# Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetZ Property

The property labeled "Offset Z" from the "Wood" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetZ { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".